account.activation=Activaci\u00f3n de cuenta
account.enable.info1=Introduce tu email de contacto para que podamos enviarte el link de activaci\u00f3n de tu cuenta.
account.enable.info2=Por motivos de seguridad es necesario que cambie la contrase\u00f1a actual.
account.enable.link=Para activar su cuenta visite el siguiente link
account.enabled=Su cuenta ha sido habilitada, ya puede entrar en el sistema con sus nuevos datos de acceso.
actual=Actual
advertencia.COLUMNAS_NOMBRES_DIFERENTES=Los nombres de las columnas del resultado obtenido no coinciden con las del resultado esperado
advertencia.DISTINCT_PARENTESIS=La cl\u00e1usula <strong>DISTINCT</strong> act\u00faa a nivel de fila, no a nivel de columna.
advertencia.ERROR_PARSEO=No se ha podido analizar la consulta para extraear advertencias.
advertencia.SUBCONSULTAS_INNECESARIAS=Est\u00e1s haciendo uso de subconsultas cuando este ejercicio se puede resolver sin usarlas.
advertencia.SUBCONSULTAS_EXCESO=El ejercicio se puede resolver usando menos subconsultas.
advertencia.SELECT_GROUPBY_INCORRECTO=Est\u00e1s usando columnas sin funci\u00f3n agregaci\u00f3n en la clausula <strong>SELECT</strong> que no se encuentran en la cl\u00e1usula <strong>GROUP BY</strong>
advertencia.TABLAS_INNECESARIAS=Est\u00e1s usando tablas innecesarias para resolver el ejercicio.
all=Todos
answer=Respuesta
answer.introduce=Introduce tu respuesta
application.exit.info=\u00bfRealmente desea salir de la aplicaci\u00f3n?
application.exit.title=Abandonar aplicaci\u00f3n
application.title=Aplicaci\u00f3n BD
author=Autor
attempts=Intentos
cancel=Cancelar
checking=Comprobando
close=Cerrar
correct=Coincidente
correct.warnings=Coincidente con advertencias
course.change=Cambiar de curso
course.change.confirm=\u00bfRealmente desea eliminar todos los alumnos y sus correspondientes entregas?
course.change.info=<p>Cambiar de curso significa que se eliminar\u00e1n todos los alumnos de la aplicaci\u00f3n, as\u00ed como sus soluciones a las pr\u00e1cticas realizadas.</p><p class="text-error">Este proceso es irreversible.</p>
course.change.success=Cambio de curso realizado con \u00e9xito
cuasi.maxlength=El campo usuario no puede contener m\u00e1s de 12 caracteres
cuasi.required=Usuario: Campo obligatorio
cuasi=Usuario
data.contact=Datos de contacto
data.personal=Datos personales
date.starting=Fecha de inicio
date.finishing=Fecha de finalizaci&oacute;n
date.completion=Fecha de realizaci\u00f3n
date.generation=Fecha de generaci\u00f3n
details=Detalles
didyouknow=Sab\u00edas que...
difficulty=Dificultad
dni.maxlength=El campo DNI no puede tener m\u00e1s de 9 car\u00e1cteres.
dni.required=DNI: Campo obligatorio
dni=DNI
download.xml.info=Puedes exportar todos los ejercicios del esquema seleccionado a un fichero XML descargable.
download.xml.title=Exportar ejercicios a XML
download=Descargar
duration=Duraci\u00f3n
easy=F\u00e1cil
email.invalid.format=El correo electr\u00f3nico es inv\u00e1lido.
email.required=El correo electr\u00f3nico es obligatorio.
email=Correo electr\u00f3nico
enabled=Habilitado
error.student.1=ya que ha realizado alguna entrega de pr\u00e1cticas.
error.student.2=ya que pertenece a un profesor ajeno.
error.student.3=ya que pertenece a un profesor ajeno.
error.student.delete=Error al intentar borrar el alumno
error.student.edit=Error al intentar editar el alumno
established=establecido
exercise.correct.saved=Ejercicio guardado
exercise.incorrect.saved=Ejercicio guardado con errores
exercise.next=Siguiente ejercicio
exercise.unsaved=Ejercicio sin guardar
exercise=Ejercicio
exercises.correct=Ejercicios correctos
exercises.incorrect=Ejercicios incorrectos
exercises.max=N\u00ba m\u00e1x. Ejercicios
exercises.return=Volver a ejercicios
exercises.unsaved=Ejercicios sin contestar
exercises=Ejercicios
export=Exportar
filters=Filtros
format=formato
hard=Dif\u00edcil
home=Inicio
id=Id
import=Importar
incorrect=Err\u00f3neo
lang=sp
link.corrupt=No existe ninguna cuenta a habilitar, compruebe que la direcci\u00f3n URL es la correcta.
link.nokey=Para poder activar su cuenta debe visitar la URL que le enviamos a su email la primera vez que entr\u00f3 en la aplicaci\u00f3n.
link.send=Le ha sido enviado un correo electr\u00f3nico con las instrucciones para habilitar su cuenta.
lock=Bloquear
login.data=Datos de conexi\u00f3n
login.new.msg=Sus nuevos datos de acceso son
login=Entrar
logout=Salir
manages.ma=Gestiona los
manages.fe=Gestiona las
medium=Media
modify=Modificar
name.required=Nombre: Campo obligatorio
name=Nombre
no=No
number=N\u00ba
panel=Panel
password.current=Contrase\u00f1a actual
password.forgot=\u00bfOlvidaste tu contrase\u00f1a?
password.new=Nueva contrase\u00f1a
password.noequals=Las contrase\u00f1as introducidas deben coincidir.
password.repeat=Repita la contrase\u00f1a
password.required=La contrase\u00f1a es obligatoria.
password.resend=Le ha sido enviado un correo electr\u00f3nico con su nueva contrase\u00f1a.
password.retrieve.info=Introduce tu nombre de usuario y tu email de contacto para que podamos enviarte una nueva contrase\u00f1a.
password.retrieve=Recuperar contrase\u00f1a
password.same=La nueva contrase\u00f1a no puede ser la misma que la actual.
password.wrong=La contrase\u00f1a es incorrecta.
password=Contrase\u00f1a
port=Puerto
practice.begin=Comenzar
practice.exercises.autosent=Los ejercicios resueltos que se encontrasen guardados han sido enviados autom\u00e1ticamente.
practice.configure.exercises=Configurar ejercicios de pr\u00e1ctica
practice.continue=Continuar
practice.current1=No se puede comenzar una pr\u00e1ctica nueva ya que otra pr\u00e1ctica se encuentra en curso actualmente.
practice.current2=La pr\u00e1ctica en curso es la
practice.current3=de la
practica.current.go=Ir a la pr\u00e1ctica en curso
practice.do=Realizar Pr\u00e1ctica
practice.exist=Ya existe una pr\u00e1ctica con el nombre proporcionado
practice.exit.info=\u00bfEst\u00e1 seguro que desea abandonar la pr\u00e1ctica?
practice.exit.title=Abandonar pr\u00e1ctica
practice.finish.info=<p>\u00bfEst\u00e1 seguro que desea terminar y enviar la pr\u00e1ctica {0}?</p><p class="contadoresTotales">Ha respondido a <span class="numRespondidos">{1} ejercicios</span>, <span class="numCorrectos text-success">{2} son coincidentes</span> y <span class="numErroneos text-error">{3} est\u00e1n mal</span>.</p>
practice.finish.info.unresolved=Hay {0} ejercicios sin responder
practice.finish.title=Terminar pr\u00e1ctica
practice.modify=Modificar datos de pr\u00e1ctica
practice.submit.noinit=No ha podido entregarse la pr\u00e1ctica, ya que no ha sido iniciada.
practice.submit.timeout=No ha sido posible entregar la pr\u00e1ctica, ya que ha finalizado su tiempo de realizaci\u00f3n.
practice.submit=Enviar pr\u00e1ctica
practice.submit.confirm=Confirmar env\u00edo
practice.summary=Resumen de la realizaci\u00f3n de ejercicios de
practice.timeout.title=Pr\u00e1ctica finalizada
practice.timeout=El tiempo para la realizaci\u00f3n de la pr\u00e1ctica ha finalizado.
practice=Pr\u00e1ctica
practices=Pr\u00e1cticas
printables=Imprimibles
processing=Procesando
professor.testFailed=Hay que comprobar que se ha elegido el esquema y la sentencia SQL no est\u00e1 vac\u00eda.
professor=Profesor
professors=Profesores
profile.update=Actualiza tu perfil
profile=Perfil
result.expected=Resultado esperado
result.obtained=Resultado obtenido
result.yours=Tu resultado es
return=Volver atr\u00e1s
return.panel=Volver al panel
revision2=del repaso
revision.of=Repaso de
revisions=Repasos
revision.begin=Comenzar
revision.continue=Continuar
revision.detail.alert=No se ha podido recuperar el detalle del repaso
revision.exercises.alert=No se han podido recuperar el detalle de los ejercicios del repaso
revision.do=Realizar Repaso
revision.error.max.required=El campo M\u00e1x.Ejercicios es Obligatorio
revision.error.max.format=El campo M\u00e1x.Ejercicios deber ser un n\u00famero v\u00e1lido
revision.error.session=El campo N\u00ba sesi\u00f3n min. debe ser menor o igual que el campo N\u00ba sesi\u00f3n m\u00e1x.
revision.error.sessionmax.format=El campo N\u00ba sesi\u00f3n m\u00e1x. deber ser un n\u00famero v\u00e1lido
revision.error.sessionmin.format=El campo N\u00ba sesi\u00f3n min. deber ser un n\u00famero v\u00e1lido
revision.noexercises=No existe ning\u00fan ejercicio con los filtros elegidos
revision.exercises=Ejercicios de repaso
revision.exit.info=\u00bfEst\u00e1 seguro que desea abandonar el repaso?
revision.exit.title=Abandonar repaso
revision.finish.info=\u00bfEst\u00e1 seguro que desea terminar el repaso?
revision.finish.title=Terminar repaso
revision.properties.info=Rellene los siguientes filtros para confeccionar una pr\u00e1ctica de repaso personalizada. Puede seleccionar varios esquemas y varios grados de dificultad
revision.properties.title=Propiedades del repaso
revision.summary=Resumen de los ejercicios del repaso
revision=Repaso
save=Guardar
scheme.exist=Ya existe un esquema con el nombre proporcionado
scheme.select.pdf=Selecciona antes el esquema al que quieres subir el PDF.
scheme.view.pdf=Ver PDF descriptivo
scheme=Esquema
schemes=Esquemas
select.exercises.save.order.error=No hay ejercicios para los que guardar el orden.
select.exercises.link=Selecciona antes los ejercicios que quieres a\u00f1adir a la pr\u00e1ctica.
select.exercises.lock=Selecciona antes los ejercicios que quieres bloquear.
select.exercises.unlink=Selecciona antes los ejercicios que quieres eliminar de la pr\u00e1ctica.
select.exercises.unlock=Selecciona antes los ejercicios que quieres desbloquear.
select.practice.details=Selecciona previamente la pr\u00e1ctica a la que quieres configurar sus ejercicios.
select.scheme.export=Selecciona antes el esquema del que quieres exportar sus ejercicios.
select.solutions.info=Selecciona las sesiones de las que desea imprimir las entregas.
select.solutions.msg=Seleccione alguna sesi\u00f3n
session.max=N\u00ba sesi\u00f3n m\u00e1ximo
session.min=N\u00ba sesi\u00f3n m\u00ednimo
session=Sesi\u00f3n
sesion.restart=Reactivar Pr&aacute;ctica
sesion.restart.sid=Sesi&oacute;n Id
sesion.restart.pid=Pr&aacute;ctica Id
sesion.restart.pname=Nombre Pr&aacute;ctica
sesion.restart.delivery=Fecha Entrega
sesion.nopractica=El alumno no ha entregado ninguna pr&aacute;ctica
sesion.restart.btn=Reactivar
sesion.restart.success=El alumno {0} ya puede volver a realizar la pr&aacute;ctica correspondiente a la sesi&oacute;n {1}
sesion.restart.success.title=\u00a1\u00a1\u00a1Sesi&oacute;n Reiniciada!!!
sesion.noselect=\u00a1\u00a1\u00a1Debe seleccionar una pr&aacute;ctica de una sesi&oacute;n para poder reactivarla!!!
sesion.mailContent=<p>Ha sido reiniciada la sesi\u00f3n {0} para que pueda volver a realizarla.<br/>\
                   En la anterior sesi\u00f3n hab\u00eda realizado los siguientes ejercicios:</p>
sesion.mailContent.enunciado=Enunciado:
sesion.mailContent.respuesta=Respuesta:
sesion.mailContent.esquema=Esquema:
sesion.mailContent.correcta=\u00bfCorrecta?:
sesion.mailContent.ejercicios.inicioDetalle=<p><ol>
sesion.mailContent.ejercicios.inicioEjercicio=<li><ul><li>
sesion.mailContent.ejercicios.finEjercicio=</li></ul></li>
sesion.mailContent.ejercicios.entreEjercicio=</li><li>
sesion.mailContent.ejercicios.finDetalle=</ol></p>
sesion.mailContent.numejresueltos=<p>Ha solucionado {0} de {1} ejercicios en la anterior realizaci\u00f3n de la pr\u00e1ctica.</p>
sesion.mailContent.noejercicios=<p style="align:center"><strong>Ning\u00fan ejercicio de la pr\u00e1ctica anterior fue guardado.</strong></p>
sgbd=SGBD
sgbd.access=MS Access
sgbd.mysql=MySQL
sgbd.oracle=Oracle
sgbd.sqlserver=MS SQL Server
solutions=Entregas
sql.query.solution=Soluci\u00f3n SQL
sql.query=Consulta SQL
statement=Enunciado
student.exist.cuasi=Ya existe un alumno con la cuasi proporcionada
student.exist.dni=Ya existe un alumno con dicho DNI
student.export.info=Seleccione los alumnos a exportar
student.file.unformatted=El fichero no cumple las reglas de formato
student.import.info=Puedes importar alumnos desde un fichero externo, siempre y cuando cumpla el siguiente formato:
student.import.info.example=# Un alumno por l\u00ednea\n# DNI, Cuasi, Apellidos, Nombre\n1661XXXXX, usuario1, Apellidos1, Nombre1\n1662XXXXX, usuario2, Apellidos2, Nombre2\n1663XXXXX, usuario3, Apellidos3, Nombre3
student.imported=alumno importado
student=Alumno
students.imported=alumnos importados
students=Alumnos
submit=Enviar
summary.download=Descargar resumen
summary.see=Ver resumen
surname.required=Apellidos: Campo obligatorio
surname=Apellidos
test=Probar
tip.1=Durante la realizaci\u00f3n de un ejercicio, puedes probar si es correcto o no, pulsando la combinaci\u00f3n de teclas <span>Ctrl+Enter</span>.
tip.2=Antes de entregar una pr\u00e1ctica, puedes descargar a tu ordenador un resumen con tus resultados, en formato <span>PDF</span>.
tip.3=Para que la entrega de una pr\u00e1ctica pueda ser evaluada, deber\u00e1s enviarla pulsando el bot\u00f3n <span>Terminar pr\u00e1ctica</span> en la pantalla del resumen.
tip.4=Los ejercicios que realices como repaso, no ser\u00e1n enviados al profesor para su evaluaci\u00f3n.
tip.5=Puedes modificar tu correo electr\u00f3nico de contacto y tu contrase\u00f1a desde la secci\u00f3n <span>Perfil</span>. La puedes encontrar en tu panel de alumno.
tip.6=Durante la realizaci\u00f3n de una pr\u00e1ctica o un repaso, si cambias de ejercicio sin guardar el anterior, perder\u00e1s la soluci\u00f3n que hayas escrito.
tip.7=S\u00f3lo podr\u00e1s realizar una \u00fanica entrega de pr\u00e1cticas por cada sesi\u00f3n de pr\u00e1cticas.
unlock=Desbloquear
unsaved=Sin guardar
update=Actualizar
upload.pdf.desc.title=Subir PDF Descriptivo
upload.pdf.info=Puedes subir un PDF descriptivo del esquema.
upload.pdf.title=Subir PDF
upload.xml.dtd=El fichero a importar debe ser v\u00e1lido ante el siguiente DTD
upload.xml.info=Puedes subir un fichero XML con los ejercicios a importar al esquema seleccionado.
upload.xml.title=Subir fichero XML
user.updated=Datos del usuario actualizados correctamente
user.noexists=No existe ning\u00fan usuario con los datos proporcionados.
username.required=El nombre de usuario es obligatorio.
username=Usuario
users=Usuarios
users.connected=Usuarios conectados
visible=Visible
warning=Aviso
welcome=Bienvenido
welcome.text.1=Bienvenido a la aplicaci\u00f3n para la realizaci\u00f3n de ejercicios de bases de datos.
welcome.text.2=Desde esta aplicaci\u00f3n podr\u00e1s realizar las pr\u00e1cticas de la asignatura de bases de datos, as\u00ed como realizar ejercicios de repaso para poner en pr\u00e1ctica lo aprendido en las clases de teor\u00eda.
yes=S\u00ed
